vehicular/PowerBoard_SW/msp430f6736/DesignCenter/emDC/emDCCommandHandlers.c
COMAND_HANDLER * CommandHandler_getUserParamsPtr(void)
{
    return &gCommandHandler;
}

void CommandHandler_registerCmdListeners()
{
    Comm_addCmdListener(COMMAND_HANDLER_EM_GUI_ID_BYTE,
                        COMMAND_HANDLER_CONFIG_MODE,
                        &Handler_config_mode);

    Comm_addCmdListener(COMMAND_HANDLER_EM_GUI_ID_BYTE,
                        COMMAND_HANDLER_APP_VERSION,
                        &Handler_app_version);

    Comm_addCmdListener(COMMAND_HANDLER_EM_GUI_ID_BYTE,
                        COMMAND_HANDLER_REQ_CALIB_VALUES,
                        &Handler_req_calib_values);

    Comm_addCmdListener(COMMAND_HANDLER_EM_GUI_ID_BYTE,
                        COMMAND_HANDLER_ADC_BUFFER_SIZE,
                        &Handler_adc_buffer_size);

    Comm_addCmdListener(COMMAND_HANDLER_EM_GUI_ID_BYTE,
                        COMMAND_HANDLER_CALIB_VALUES,
                        &Handler_calib_values);

    Comm_addCmdListener(COMMAND_HANDLER_EM_GUI_ID_BYTE,
                        COMMAND_HANDLER_CALIB_PHASE,
                        &Handler_calib_phase);

    Comm_addCmdListener(COMMAND_HANDLER_EM_GUI_ID_BYTE,
                        COMMAND_HANDLER_CALIB_SAVE,
                        &Handler_calib_save);
}


void CommandHandler_transmitPacket(Packet_t *packet)
{
    Comm_writePacket(packet);

#if (COMM_SERIAL_INTERFACE==COMM_UART)
    while(g_ui16UARTTransmitBytesLeft!=0);
#else
    while(g_I2CSlaveStatus != 0x01);
#endif

}

void Handler_config_mode(Packet_t *packet)
{
    uint8_t i = 3;
    //
    // check if WRITE command
    //
    if (packet->payload[COMMAND_HANDLER_R_W_BYTE_POS] ==
            COMMAND_HANDLER_WRITE_CMD)
    {
        gCommandHandler.appMode = packet->payload[i++];
        // Clear calib phase ID
        gCommandHandler.calibPhaseID = 0x00;
    }else
    {
        packet->payload[COMMAND_HANDLER_R_W_BYTE_POS] =COMMAND_HANDLER_WRITE_CMD;

        // Echo values in case command was received in read command
        packet->payload[i++] = gCommandHandler.appMode;

        Comm_writePacket(packet);
    }
}

void Handler_app_version(Packet_t *packet)
{
    uint8_t i = 3;
    //
    // check if WRITE command
    //
    if (packet->payload[COMMAND_HANDLER_R_W_BYTE_POS] ==
            COMMAND_HANDLER_WRITE_CMD)
    {
        gCommandHandler.deviceId = (COMMAND_HANDLER_DEVICE_TYPE) packet->payload[i++];
        gCommandHandler.fwId = (COMMAND_HANDLER_FIRMWARE_ID) packet->payload[i++];

    }else
    {
        packet->payload[COMMAND_HANDLER_R_W_BYTE_POS] =COMMAND_HANDLER_WRITE_CMD;

        // Echo values in case command was received in read command
        packet->payload[i++] = (uint8_t)gCommandHandler.deviceId;
        packet->payload[i++] = (uint8_t)gCommandHandler.fwId;

        Comm_writePacket(packet);
    }
}

void Handler_req_calib_values(Packet_t *packet)
{
    uint8_t i = 3;
    //
    // check if WRITE command
    //
    if (packet->payload[COMMAND_HANDLER_R_W_BYTE_POS] ==
            COMMAND_HANDLER_WRITE_CMD)
    {
        gCommandHandler.calibReqUpdate = packet->payload[i++];
    }else
    {
        packet->payload[COMMAND_HANDLER_R_W_BYTE_POS] =COMMAND_HANDLER_WRITE_CMD;

        // Echo values in case command was received in read command
        packet->payload[i++] =(uint8_t)gCommandHandler.calibReqUpdate;

        Comm_writePacket(packet);
    }
}

void Handler_adc_buffer_size(Packet_t *packet)
{
    uint8_t i = 3;
    //
    // check if WRITE command
    //
    if (packet->payload[COMMAND_HANDLER_R_W_BYTE_POS] ==
            COMMAND_HANDLER_WRITE_CMD)
    {
        // Do nothing
    }else
    {
        packet->payload[COMMAND_HANDLER_R_W_BYTE_POS] =COMMAND_HANDLER_WRITE_CMD;

        // Echo values in case command was received in read command
        packet->payload[i++] = (uint8_t) HAL_ADC_V_ARRAY_LENGTH;
        packet->payload[i++] = (uint8_t) HAL_ADC_I_ARRAY_LENGTH;

        Comm_writePacket(packet);
    }
}

void Handler_calib_values(Packet_t *packet)
{
    uint8_t *calib = (uint8_t *) gEmSWConfig.meterConfig->phaseConfigPtr[gCommandHandler.calibPhaseIdx].phaseCalibPtr;

    //
    // check if WRITE command
    //
    if (packet->payload[COMMAND_HANDLER_R_W_BYTE_POS] ==
            COMMAND_HANDLER_WRITE_CMD)
    {
        //Voltage Scale Factor
        calib[0] = packet->payload[4];
        calib[1] = packet->payload[5];
        calib[2] = packet->payload[6];
        calib[3] = packet->payload[7];

        // Current Scale Factor
        calib[4] = packet->payload[8];
        calib[5] = packet->payload[9];
        calib[6] = packet->payload[10];
        calib[7] = packet->payload[11];

        // Active Power Scale Factor
        calib[8] = packet->payload[12];
        calib[9] = packet->payload[13];
        calib[10] = packet->payload[14];
        calib[11] = packet->payload[15];

        // Reactive Power Scale Factor
        calib[12] = packet->payload[12];
        calib[13] = packet->payload[13];
        calib[14] = packet->payload[14];
        calib[15] = packet->payload[15];

        // Phase Correction
        calib[16] = packet->payload[16];
        calib[17] = packet->payload[17];

        gCommandHandler.calibSetPreloadFlag = true;
    }else
    {
        packet->payload[COMMAND_HANDLER_R_W_BYTE_POS] =COMMAND_HANDLER_WRITE_CMD;

        //Voltage Scale Factor
        packet->payload[4] = calib[0];
        packet->payload[5] = calib[1];
        packet->payload[6] = calib[2];
        packet->payload[7] = calib[3];

        // Current Scale Factor
        packet->payload[8] = calib[4];
        packet->payload[9] = calib[5];
        packet->payload[10] = calib[6];
        packet->payload[11] = calib[7];

        // Active Power Scale Factor
        packet->payload[12] = calib[8];
        packet->payload[13] = calib[9];
        packet->payload[14] = calib[10];
        packet->payload[15] = calib[11];

        // Phase Correction
        packet->payload[16] = calib[16];
        packet->payload[17] = calib[17];

        Comm_writePacket(packet);
    }
}

