vehicular/PowerBoard_SW/msp430f6736/DesignCenter/emDC/emDCCommandHandlers.c
void Handler_calib_phase(Packet_t *packet)
{
    uint8_t i = 3;
    //
    // check if WRITE command
    //
    if (packet->payload[COMMAND_HANDLER_R_W_BYTE_POS] ==
            COMMAND_HANDLER_WRITE_CMD)
    {
        gCommandHandler.calibPhaseID = packet->payload[i];
        gCommandHandler.calibPhaseIdxFlag = true;
    }else
    {
        packet->payload[COMMAND_HANDLER_R_W_BYTE_POS] =COMMAND_HANDLER_WRITE_CMD;

        // Echo values in case command was received in read command
        packet->payload[i++] =(uint8_t)gCommandHandler.calibPhaseID;

        Comm_writePacket(packet);
    }
}

void Handler_calib_save(Packet_t *packet)
{
    uint8_t i = 3;
    //
    // check if WRITE command
    //
    if (packet->payload[COMMAND_HANDLER_R_W_BYTE_POS] ==
            COMMAND_HANDLER_WRITE_CMD)
    {
        gCommandHandler.calibReqSaveFlag = 0x01;
    }else
    {
        packet->payload[COMMAND_HANDLER_R_W_BYTE_POS] =COMMAND_HANDLER_WRITE_CMD;

        // Echo values in case command was received in read command
        packet->payload[i++] =(uint8_t)gCommandHandler.calibPhaseID;

        Comm_writePacket(packet);
    }
}

/**********CommandHandler_setApplicationVersion**********/
/* this function initializes the global variable "gComandHandler" of type "COMAND_HANDLER"
 * ... "COMAND_HANDLER" is the struct that is used to hold all the data received from the GUI
 * this global variable is used to store all the desired values/data retrieved from a GUI 'Request Update'
 *
 * specifically the following routine will initialize the deviceID, and fwId variables within
 * the "COMMAND_HANDLER" struct for "gComandHandler"
 */
void CommandHandler_setApplicationVersion(
        COMMAND_HANDLER_DEVICE_TYPE deviceID,
        COMMAND_HANDLER_FIRMWARE_ID fwId)
{
    gCommandHandler.deviceId = deviceID;
    gCommandHandler.fwId = fwId;

}

void CommandHandler_transmitVRMS(Packet_t *packet,
                                 uint8_t phaseID,
                                 uint8_t *vrms)
{
    packet->length = 8;
    packet->payload[0] = COMMAND_HANDLER_EM_GUI_ID_BYTE;
    packet->payload[1] = COMMAND_HANDLER_VRMS_ID;
    packet->payload[2] = COMMAND_HANDLER_WRITE_CMD;
    packet->payload[3] = phaseID;
    packet->payload[4] = vrms[0];
    packet->payload[5] = vrms[1];
    packet->payload[6] = vrms[2];
    packet->payload[7] = vrms[3];

    Comm_writePacket(packet);
}

void CommandHandler_transmitIRMS(Packet_t *packet,
                                 uint8_t phaseID,
                                 uint8_t *irms)
{
    packet->length = 8;
    packet->payload[0] = COMMAND_HANDLER_EM_GUI_ID_BYTE;
    packet->payload[1] = COMMAND_HANDLER_IRMS_ID;
    packet->payload[2] = COMMAND_HANDLER_WRITE_CMD;
    packet->payload[3] = phaseID;
    packet->payload[4] = irms[0];
    packet->payload[5] = irms[1];
    packet->payload[6] = irms[2];
    packet->payload[7] = irms[3];

    Comm_writePacket(packet);
}

void CommandHandler_transmitVPeak(Packet_t *packet,
                                 uint8_t phaseID,
                                 uint8_t *vPeak)
{
    packet->length = 8;
    packet->payload[0] = COMMAND_HANDLER_EM_GUI_ID_BYTE;
    packet->payload[1] = COMMAND_HANDLER_VPEAK_ID;
    packet->payload[2] = COMMAND_HANDLER_WRITE_CMD;
    packet->payload[3] = phaseID;
    packet->payload[4] = vPeak[0];
    packet->payload[5] = vPeak[1];
    packet->payload[6] = vPeak[2];
    packet->payload[7] = vPeak[3];

    Comm_writePacket(packet);
}

void CommandHandler_transmitIPeak(Packet_t *packet,
                                 uint8_t phaseID,
                                 uint8_t *iPeak)
{
    packet->length = 8;
    packet->payload[0] = COMMAND_HANDLER_EM_GUI_ID_BYTE;
    packet->payload[1] = COMMAND_HANDLER_IPEAK_ID;
    packet->payload[2] = COMMAND_HANDLER_WRITE_CMD;
    packet->payload[3] = phaseID;
    packet->payload[4] = iPeak[0];
    packet->payload[5] = iPeak[1];
    packet->payload[6] = iPeak[2];
    packet->payload[7] = iPeak[3];

    Comm_writePacket(packet);
}

void CommandHandler_transmitPowerFactor(Packet_t *packet,
                                        uint8_t phaseID,
                                        uint8_t *pFactor)
{
    packet->length = 8;
    packet->payload[0] = COMMAND_HANDLER_EM_GUI_ID_BYTE;
    packet->payload[1] = COMMAND_HANDLER_POWER_FACTOR_ID;
    packet->payload[2] = COMMAND_HANDLER_WRITE_CMD;
    packet->payload[3] = phaseID;
    packet->payload[4] = pFactor[0];
    packet->payload[5] = pFactor[1];
    packet->payload[6] = pFactor[2];
    packet->payload[7] = pFactor[3];

    Comm_writePacket(packet);
}

void CommandHandler_transmitFrequency(Packet_t *packet,
                                      uint8_t phaseID,
                                      uint8_t *frequency)
{
    packet->length = 6;
    packet->payload[0] = COMMAND_HANDLER_EM_GUI_ID_BYTE;
    packet->payload[1] = COMMAND_HANDLER_FREQUENCY_ID;
    packet->payload[2] = COMMAND_HANDLER_WRITE_CMD;
    packet->payload[3] = phaseID;
    packet->payload[4] = frequency[0];
    packet->payload[5] = frequency[1];

    Comm_writePacket(packet);
}

void CommandHandler_transmitActivePower(Packet_t *packet,
                                        uint8_t phaseID,
                                        uint8_t *actPower)
{
    packet->length = 12;
    packet->payload[0] = COMMAND_HANDLER_EM_GUI_ID_BYTE;
    packet->payload[1] = COMMAND_HANDLER_ACTIVE_POWER_ID;
    packet->payload[2] = COMMAND_HANDLER_WRITE_CMD;
    packet->payload[3] = phaseID;
    packet->payload[4] = actPower[0];
    packet->payload[5] = actPower[1];
    packet->payload[6] = actPower[2];
    packet->payload[7] = actPower[3];
    packet->payload[8] = actPower[4];
    packet->payload[9] = actPower[5];
    packet->payload[10] = actPower[6];
	packet->payload[11] = actPower[7];
	
    Comm_writePacket(packet);
}

void CommandHandler_transmitReactivePower(Packet_t *packet,
                                         uint8_t phaseID,
                                         uint8_t *reactPower)
{
    packet->length = 12;
    packet->payload[0] = COMMAND_HANDLER_EM_GUI_ID_BYTE;
    packet->payload[1] = COMMAND_HANDLER_REACTIVE_POWER_ID;
    packet->payload[2] = COMMAND_HANDLER_WRITE_CMD;
    packet->payload[3] = phaseID;
    packet->payload[4] = reactPower[0];
    packet->payload[5] = reactPower[1];
    packet->payload[6] = reactPower[2];
    packet->payload[7] = reactPower[3];
    packet->payload[8] = reactPower[4];
    packet->payload[9] = reactPower[5];
    packet->payload[10] = reactPower[6];
	packet->payload[11] = reactPower[7];
	
    Comm_writePacket(packet);
}

