vehicular/PowerBoard_SW/msp430f6736/DesignCenter/emDC/emDCCommandHandlers.c
void CommandHandler_transmitApparentPower(Packet_t *packet,
                                          uint8_t phaseID,
                                          uint8_t *appPower)
{
    packet->length = 12;
    packet->payload[0] = COMMAND_HANDLER_EM_GUI_ID_BYTE;
    packet->payload[1] = COMMAND_HANDLER_APPARENT_POWER_ID;
    packet->payload[2] = COMMAND_HANDLER_WRITE_CMD;
    packet->payload[3] = phaseID;
    packet->payload[4] = appPower[0];
    packet->payload[5] = appPower[1];
    packet->payload[6] = appPower[2];
    packet->payload[7] = appPower[3];
    packet->payload[8] = appPower[4];
    packet->payload[9] = appPower[5];
    packet->payload[10] = appPower[6];
	packet->payload[11] = appPower[7];
	
    Comm_writePacket(packet);
}

void CommandHandler_transmitActiveEnergy(Packet_t *packet,
                                         uint8_t phaseID,
                                         uint8_t *actEnergy)
{
    packet->length = 12;
    packet->payload[0] = COMMAND_HANDLER_EM_GUI_ID_BYTE;
    packet->payload[1] = COMMAND_HANDLER_ACTIVE_ENERGY_ID;
    packet->payload[2] = COMMAND_HANDLER_WRITE_CMD;
    packet->payload[3] = phaseID;
    packet->payload[4] = actEnergy[0];
    packet->payload[5] = actEnergy[1];
    packet->payload[6] = actEnergy[2];
    packet->payload[7] = actEnergy[3];
    packet->payload[8] = actEnergy[4];
    packet->payload[9] = actEnergy[5];
    packet->payload[10] = actEnergy[6];
	packet->payload[11] = actEnergy[7];
	
    Comm_writePacket(packet);
}

void CommandHandler_transmitReactiveEnergy(Packet_t *packet,
                                          uint8_t phaseID,
                                          uint8_t *reactEnergy)
{
    packet->length = 12;
    packet->payload[0] = COMMAND_HANDLER_EM_GUI_ID_BYTE;
    packet->payload[1] = COMMAND_HANDLER_REACTIVE_ENERGY_ID;
    packet->payload[2] = COMMAND_HANDLER_WRITE_CMD;
    packet->payload[3] = phaseID;
    packet->payload[4] = reactEnergy[0];
    packet->payload[5] = reactEnergy[1];
    packet->payload[6] = reactEnergy[2];
    packet->payload[7] = reactEnergy[3];
    packet->payload[8] = reactEnergy[4];
    packet->payload[9] = reactEnergy[5];
    packet->payload[10] = reactEnergy[6];
	packet->payload[11] = reactEnergy[7];
	
    Comm_writePacket(packet);
}

void CommandHandler_transmitApparentEnergy(Packet_t *packet,
                                           uint8_t phaseID,
                                           uint8_t *appEnergy)
{
    packet->length = 12;
    packet->payload[0] = COMMAND_HANDLER_EM_GUI_ID_BYTE;
    packet->payload[1] = COMMAND_HANDLER_APPARENT_ENERGY_ID;
    packet->payload[2] = COMMAND_HANDLER_WRITE_CMD;
    packet->payload[3] = phaseID;
    packet->payload[4] = appEnergy[0];
    packet->payload[5] = appEnergy[1];
    packet->payload[6] = appEnergy[2];
    packet->payload[7] = appEnergy[3];
    packet->payload[8] = appEnergy[4];
    packet->payload[9] = appEnergy[5];
    packet->payload[10] = appEnergy[6];
	packet->payload[11] = appEnergy[7];
	
    Comm_writePacket(packet);
}

void CommandHandler_transmitCalibration(Packet_t *packet,
                                           uint8_t phaseID,
                                           uint8_t *calib)
{
    packet->length = 18;
    packet->payload[0] = COMMAND_HANDLER_EM_GUI_ID_BYTE;
    packet->payload[1] = COMMAND_HANDLER_CALIB_VALUES;
    packet->payload[2] = COMMAND_HANDLER_WRITE_CMD;
    packet->payload[3] = phaseID;

    //Voltage Scale Factor
    packet->payload[4] = calib[0];
    packet->payload[5] = calib[1];
    packet->payload[6] = calib[2];
    packet->payload[7] = calib[3];

    // Current Scale Factor
    packet->payload[8] = calib[4];
    packet->payload[9] = calib[5];
    packet->payload[10] = calib[6];
    packet->payload[11] = calib[7];

    // Active Power Scale Factor
    packet->payload[12] = calib[8];
    packet->payload[13] = calib[9];
    packet->payload[14] = calib[10];
    packet->payload[15] = calib[11];

    // Phase Correction
    packet->payload[16] = calib[16];
    packet->payload[17] = calib[17];

    Comm_writePacket(packet);
}

void CommandHandler_transmitReqCalibrationValues(Packet_t *packet)
{
    packet->length = 4;
    packet->payload[0] = COMMAND_HANDLER_EM_GUI_ID_BYTE;
    packet->payload[1] = COMMAND_HANDLER_REQ_CALIB_VALUES;
    packet->payload[2] = COMMAND_HANDLER_WRITE_CMD;
    // Target has transmitted all the phase calibration values to EMDC
    packet->payload[3] = COMMAND_HANDLER_CALIB_REQ_COMPLETED;

    Comm_writePacket(packet);
}

void CommandHandler_transmitCalibrationSave(Packet_t *packet)
{
    packet->length = 5;
    packet->payload[0] = COMMAND_HANDLER_EM_GUI_ID_BYTE;
    packet->payload[1] = COMMAND_HANDLER_CALIB_SAVE;
    packet->payload[2] = COMMAND_HANDLER_WRITE_CMD;
    packet->payload[3] = gCommandHandler.calibPhaseID;
    // Target has finished writing calibration values to flash
    packet->payload[4] = 0x01;

    Comm_writePacket(packet);
}
